INCOME_OBJECT_TYPE_MAPPING = {
    'заробітна плата отримана за основним місцем роботи': 'salarymain',
    'заробітна плата отримана за сумісництвом': 'salarysecond',
    'пенсія': 'pension',
    'дохід від надання майна в оренду': 'leasing',
    'дохід від зайняття підприємницькою діяльністю': 'business',
    'гонорари та інші виплати згідно з цивільно-правовим правочинами': 'contractfee',
    'дохід від зайняття незалежною професійною діяльністю': 'indepprof',
    'проценти': 'interest',
    'дивіденди': 'dividends',
    'роялті': 'royalty',
    'страхові виплати': 'insurance',
    'подарунок у негрошовій формі': 'presentnomoney',
    'подарунок у грошовій формі': 'presentmoney',
    'благодійна допомога': 'charity',
    'приз': 'prize',
    'дохід від відчуження нерухомого майна': 'saleestate',
    'дохід від відчуження рухомого майна (крім цінних паперів та корпоративних прав)': 'salemovable',
    'дохід від відчуження цінних паперів та корпоративних прав': 'salestock',
    'спадщина': 'inheritance',
    'інше': 'other'
}

ASSET_OBJECT_TYPE_MAPPING = {
    'кошти, розміщені на банківських рахунках': 'bank',
    'готівкові кошти': 'cash',
    'внески до кредитних спілок та інших небанківських фінансових установ': 'credit_union',
    'кошти, позичені третім особам': 'lend',
    'активи у дорогоцінних (банківських) металах': 'metals',
    'інше': 'other'
}

FOREIGN_SOURCE_TAGS = [
    'іноземний громадянин',
    'юридична особа, зареєстрована за кордоном'
]
